Plantucha/SomnoTrace/sdkconfig.defaults
# SomnoTrace default project configuration.
# These defaults seed the generated (git-ignored) sdkconfig. Set the target
# with: ./scripts/idf.sh set-target esp32s3

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16 MB, recommended for OTA + EDF staging. Adjust to your module.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Custom partition table (OTA + 16MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Use the native USB Serial/JTAG for console/logging (USB-C).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Wi-Fi defaults
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# HTTP server: enough URI handlers and header space for the portal
# Mobile browsers send very long headers during captive-portal detection.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512
